{
  "backend/main.mo": "Motoko actor defining a Contact type with name, email, message, sender, and timestamp fields, storing contacts in a Set with add and query methods for submission and retrieval.",
  "feature_evidence.json": "Feature evidence report documenting the update of the contact email address to gocodezone@googlegroups.com in the Contact page, with high confidence and test ID REQ-14.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files including pages, components, hooks, and configuration files for the GoCode Zone React application.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark themes, including background, foreground, primary, secondary, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'GoCode Zone', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with seven routes (Home, About, Course, Join, VIP, Privacy, Contact) in a Layout with Navigation, Footer, and Toaster, wrapped in ThemeProvider.",
  "frontend/src/components/ContactForm.tsx": "Contact form Card component with name, email, and message inputs, validation, submission via useSubmitContact hook, loading states, and toast notifications for success/error feedback.",
  "frontend/src/components/FAQ.tsx": "FAQ section with Accordion component displaying five common questions about prerequisites, course duration, Go language benefits, Discord community, and VIP membership.",
  "frontend/src/components/Footer.tsx": "Site footer with GoCode Zone branding, quick links to pages, Discord community link (https://discord.gg/y5EBSaf8r2), copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation with logo, desktop menu buttons, and mobile Sheet drawer, highlighting active routes and providing links to all seven pages.",
  "frontend/src/components/Testimonials.tsx": "Displays a grid of three student testimonials with avatars, names, roles, and feedback about the GoCode Zone learning platform.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all contacts and submitting new contact form data through the ICP backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including Go brand colors (blue and cyan) and design tokens for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/About.tsx": "About page explaining what Go/Golang is, what GoCode Zone offers, and the target audiences (beginners, students, developers) with hero section and informational cards.",
  "frontend/src/pages/Contact.tsx": "Contact page with a contact form and alternative communication methods including Discord, email, and messaging options displayed in styled cards.",
  "frontend/src/pages/Course.tsx": "Displays the course syllabus page with 4 units covering Go fundamentals (Getting Started, Variables & Data Types, If & Switch, Loops), showing unit details, topics, and navigation to lessons.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with Go Gopher image, benefits grid highlighting beginner-friendly lessons and community features, plus Testimonials and FAQ components.",
  "frontend/src/pages/Join.tsx": "Discord community invitation page showcasing community features, step-by-step joining instructions, server rules, and a prominent Discord invite button linking to the server.",
  "frontend/src/pages/Privacy.tsx": "Privacy policy page displaying information collection practices, data usage policies, and user rights in a structured card layout with effective date and contact information.",
  "frontend/src/pages/VIP.tsx": "VIP membership marketing page highlighting premium features like private mentorship, advanced lessons, and real-world projects, with comparison between standard and VIP-only features.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, fonts (Inter and JetBrains Mono), and accordion animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for GoCode Zone, a Go programming learning platform with Discord integration, featuring 4-unit course curriculum, VIP/Premium tier, and multiple pages (Home, About, Course, Join Discord, Privacy Policy). Tracks 8 implemented features including testimonials and FAQ sections."
}