{
  "backend/main.mo": "Motoko actor defining a Contact type with name, email, message, sender, and timestamp fields, storing contacts in a Set with custom comparison logic, and exposing onContact and getAllContacts functions for submission and retrieval.",
  "feature_evidence.json": "Feature evidence report mapping seven implemented features (Home, About, Course, Join, VIP, Privacy, Contact pages) to their corresponding files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including pages, components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'GoCode Zone' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with seven routes (Home, About, Course, Join, VIP, Privacy, Contact) wrapped in ThemeProvider, using a Layout component with Navigation, Outlet, Footer, and Toaster.",
  "frontend/src/components/ContactForm.tsx": "Contact form card component with name, email, and message inputs, client-side validation, submission via useSubmitContact hook, loading states, and toast notifications for success/error feedback.",
  "frontend/src/components/FAQ.tsx": "FAQ section component rendering five accordion items covering beginner experience, course duration, Go language benefits, Discord community activity, and VIP membership details.",
  "frontend/src/components/Footer.tsx": "Site footer with three-column grid layout displaying GoCode Zone branding, quick navigation links, Discord community link, copyright notice, and Caffeine.ai attribution with dynamic UTM tracking.",
  "frontend/src/components/Navigation.tsx": "Navigation component with sticky header, logo, and responsive menu using TanStack Router for routing. Includes desktop nav bar and mobile sheet menu with active route highlighting.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section component displaying three student reviews in a responsive grid layout with avatars and cards.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP. Manages login state, identity persistence, and provides login/logout functions with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching all contacts and submitting new contact form data via the backend actor. Includes automatic cache invalidation on successful mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes and Go brand colors (blue and cyan). Includes utility classes for Go-themed styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/About.tsx": "About page explaining what Go/Golang is, what GoCode Zone offers, and who the target audience is (beginners, students, developers). Features hero section and informational cards.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form component and alternative contact methods (Discord, email, message) displayed in cards with icons.",
  "frontend/src/pages/Course.tsx": "Displays the course syllabus with 4 units covering Go fundamentals (Getting Started, Variables & Data Types, If & Switch, Loops). Each unit card shows topics and includes a link to start learning.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with Go Gopher image, benefits grid highlighting beginner-friendly lessons and community features, plus Testimonials and FAQ components.",
  "frontend/src/pages/Join.tsx": "Discord community invitation page showcasing community features, step-by-step joining instructions, and server rules with a prominent Discord join button.",
  "frontend/src/pages/Privacy.tsx": "Privacy policy page displaying information collection practices, usage policies, and user rights in a card-based layout with an effective date of February 21, 2026.",
  "frontend/src/pages/VIP.tsx": "VIP membership marketing page highlighting premium features like private mentorship, advanced lessons, and real-world projects, with comparison between standard and VIP-only features.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, fonts (Inter and JetBrains Mono), and animations for accordion components.",
  "project_state.json": "Project state file documenting GoCode Zone, a Go programming learning platform with Discord integration, featuring a multi-page structure (Home, About, Course, Join Discord, Privacy Policy, VIP/Premium) and a 4-unit course curriculum with quizzes and tests."
}