{
  "backend/main.mo": "Main Motoko actor implementing course management (units, lessons), user profiles, announcements, member management, contact submissions, and authorization via MixinAuthorization with AccessControl state.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features related to separating admin login flow from regular user authentication, removing admin navigation links, and updating admin page authentication checks.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and configuration files describing the GoCode Zone learning platform UI, routing, authentication, and admin functionality.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode design tokens for the application theme.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, about, course, join, vip, privacy, contact, admin) wrapped in ThemeProvider with shared Layout component.",
  "frontend/src/components/admin/AnnouncementManager.tsx": "Admin component for creating and publishing announcements with title/content form, mutation handling, and list view of published announcements with timestamps.",
  "frontend/src/components/admin/CourseEditor.tsx": "Admin interface for editing course unit metadata (title, description, topics) with inline editing, save/cancel actions, and mutation-based updates.",
  "frontend/src/components/admin/LessonManager.tsx": "Admin component for adding new lessons with title, content, unit association, and order fields; displays existing lessons grouped by unit.",
  "frontend/src/components/admin/MembersList.tsx": "Displays a searchable, scrollable list of all registered members with their VIP status, principal IDs, and join dates. Uses skeleton loaders during data fetching and shows badge indicators for VIP/Free status.",
  "frontend/src/components/admin/VIPManager.tsx": "Admin component for granting and revoking VIP access to members by principal ID. Includes a confirmation dialog, displays current VIP members list, and handles VIP status mutations with toast notifications.",
  "frontend/src/components/AnnouncementsList.tsx": "Component fetching and displaying announcements from backend in card format with title, formatted timestamp, and content, handling loading and empty states.",
  "frontend/src/components/ContactForm.tsx": "Contact form with name, email, and message fields, validation, backend submission via useSubmitContact hook, and toast notifications for success/error feedback.",
  "frontend/src/components/FAQ.tsx": "Accordion-based FAQ section displaying five common questions about the platform, course duration, Go language benefits, community, and VIP membership.",
  "frontend/src/components/Footer.tsx": "Footer component displaying brand logo, quick navigation links (About, Course, VIP, Privacy), Discord community link, copyright notice, and attribution to caffeine.ai.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, manages authentication state, and clears query cache on logout.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with logo, desktop/mobile menus, route highlighting, and integrated LoginButton; uses Sheet component for mobile drawer.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section displaying three student reviews in a responsive grid with avatars, names, roles, and feedback content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, automatically recreating it when identity changes and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider component with login/logout functionality, identity persistence, and configurable AuthClient options including derivation origin support.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including contacts, course units, announcements, lessons, VIP members, and admin status checks. Handles mutations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including Go brand colors (blue and cyan) and comprehensive design tokens for UI components using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/About.tsx": "About page explaining Go (Golang) and GoCode Zone platform, including target audiences (beginners, students, developers) and the platform's mission to teach Go programming through structured curriculum and community support.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with authentication via Internet Identity, access control checks, and tabbed interface for managing courses, announcements, lessons, VIP members, and member lists. Shows login prompt for unauthenticated users and access denied for non-admin users.",
  "frontend/src/pages/Contact.tsx": "Contact page with a contact form and multiple communication channels (Discord, email, message) displayed in cards with icons and descriptions. Includes hero section with call-to-action messaging.",
  "frontend/src/pages/Course.tsx": "Course syllabus page displaying structured learning units fetched from backend, showing unit titles, descriptions, topics with checkmarks, and badges for course features (4 units, weekly quizzes, big tests).",
  "frontend/src/pages/Home.tsx": "Homepage with hero section featuring Go Gopher image, call-to-action buttons for joining Discord and viewing course, benefits cards (lessons, quizzes, challenges, community), announcements list, testimonials, and FAQ sections.",
  "frontend/src/pages/Join.tsx": "React component for the Discord community join page, featuring hero section, community features grid, step-by-step joining instructions, and community rules with a call-to-action button linking to Discord.",
  "frontend/src/pages/Privacy.tsx": "React component displaying the privacy policy page with sections for effective date, introduction, information collection, and usage policies, structured using Card components.",
  "frontend/src/pages/VIP.tsx": "React component for the VIP membership page showcasing premium features, comparing standard vs VIP benefits, and promoting advanced Go learning content with mentorship and exclusive resources.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes (including Go-specific colors), container settings, extended theme properties, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project state file tracking GoCode Zone, a Go programming learning platform with courses, quizzes, Discord integration, and admin panel. Contains 21 implemented features including home page, course syllabus, authentication, admin dashboard, and VIP membership system."
}