{
  "backend/main.mo": "Main actor defining the backend canister with authorization system, user profiles, course units, lessons, announcements, members, and contacts, including CRUD operations and access control checks for admin and user permissions.",
  "backend/migration.mo": "Migration module defining type definitions for all data structures (UserProfile, CourseUnit, Lesson, Announcement, Member, Contact) with a run function that currently performs no migration logic.",
  "feature_evidence.json": "Feature evidence report documenting six implemented admin features: admin dashboard route, course content editing, announcement posting, lesson upload, VIP access management, and member viewing functionality with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages, components, hooks, and configuration files describing their functionality and implementation details.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes, including custom design tokens for background, foreground, primary, secondary, and other UI elements.",
  "frontend/index.html": "HTML entry point with basic structure, viewport meta tag, title 'GoCode Zone', root div, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with eight routes (home, about, course, join, vip, privacy, contact, admin) wrapped in ThemeProvider with shared Layout component containing Navigation, Outlet, Footer, and Toaster.",
  "frontend/src/components/admin/AnnouncementManager.tsx": "Admin component for creating and publishing announcements with a form for title and content, displays a list of all published announcements with timestamps, and handles mutations with toast notifications.",
  "frontend/src/components/admin/CourseEditor.tsx": "Admin component for editing course units with inline editing functionality, allowing updates to unit titles, descriptions, and topics (newline-separated), with save/cancel actions and mutation handling.",
  "frontend/src/components/admin/LessonManager.tsx": "Admin component for adding and viewing lessons organized by course units, with form inputs for title, content, unit association, and ordering.",
  "frontend/src/components/admin/MembersList.tsx": "Displays a searchable, scrollable list of all registered members with their VIP status, principal IDs, and join dates.",
  "frontend/src/components/admin/VIPManager.tsx": "Admin interface for granting or revoking VIP access to members by principal ID, with confirmation dialogs and a list of current VIP members.",
  "frontend/src/components/AnnouncementsList.tsx": "Component fetching and displaying announcements from backend using useGetAllAnnouncements hook, rendering cards with title, formatted timestamp, and content with loading skeletons and empty state handling.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with name, email, and message fields, form validation, submission via useSubmitContact hook, toast notifications for success/error states, and loading indicators.",
  "frontend/src/components/FAQ.tsx": "Displays a frequently asked questions section using an accordion component with five predefined Q&A pairs about the GoCode Zone course, covering topics like prerequisites, duration, language benefits, community, and VIP membership.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, quick navigation links, Discord community link, copyright notice, and a \"Built with caffeine.ai\" attribution with dynamic UTM tracking.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button that integrates with Internet Identity authentication, handles login state, clears query cache on logout, and manages error cases including duplicate authentication attempts.",
  "frontend/src/components/Navigation.tsx": "Implements a sticky header navigation bar with desktop and mobile (sheet) layouts, displaying navigation links, conditional admin link for authenticated admins, and a login button.",
  "frontend/src/components/Testimonials.tsx": "Displays a testimonials section with three hardcoded student reviews in a responsive card grid, each showing an avatar with initials, name, role, and testimonial content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including contacts, course units, announcements, lessons, and VIP member management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including Go brand colors (blue/cyan) and design tokens for UI components using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/About.tsx": "About page explaining Go programming language, GoCode Zone platform, and target audiences (beginners, students, developers) with hero section and informational content cards.",
  "frontend/src/pages/Admin.tsx": "Admin panel page with authentication checks and tabs for managing course content, announcements, lessons, VIP access, and members; restricts access to authenticated admin users only.",
  "frontend/src/pages/Contact.tsx": "Contact page featuring a contact form and alternative communication methods (Discord, email) with cards displaying contact information and links.",
  "frontend/src/pages/Course.tsx": "Course syllabus page displaying course units fetched from backend, showing unit titles, descriptions, topics, and badges for course structure with loading skeletons.",
  "frontend/src/pages/Home.tsx": "Homepage with hero section, benefits cards (lessons, quizzes, challenges, community), announcements list, testimonials, and FAQ sections promoting the GoCode Zone platform.",
  "frontend/src/pages/Join.tsx": "React component for the Discord community join page, featuring hero section, community features grid, step-by-step joining instructions, and community rules with a call-to-action button linking to Discord.",
  "frontend/src/pages/Privacy.tsx": "React component displaying the privacy policy page with sections for effective date, introduction, information collection, and usage practices, structured using Card components.",
  "frontend/src/pages/VIP.tsx": "React component for the VIP membership page showcasing premium features, comparing standard vs VIP benefits, and promoting advanced Go learning content with mentorship and exclusive resources.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes (including Go-themed colors), container settings, extended utilities, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project state file tracking GoCode Zone, a Go programming learning platform with Discord integration, course curriculum (4 units), VIP tier, and admin panel. Contains 13 implemented features including home, about, course, privacy pages, testimonials, navigation, footer, and admin functionality."
}