{
  "backend/main.mo": "Motoko actor defining a Contact type with name, email, message, sender, and timestamp fields, storing contacts in a Set with custom comparison logic, and exposing onContact() for submission and getAllContacts() query functions.",
  "feature_evidence.json": "Empty feature evidence report JSON with no features listed.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files including pages, components, hooks, and configuration files for the GoCode Zone application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for backgrounds, foregrounds, borders, and UI components.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'GoCode Zone' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with seven routes (Home, About, Course, Join, VIP, Privacy, Contact), shared Layout with Navigation/Footer, ThemeProvider, and Toaster for notifications.",
  "frontend/src/components/ContactForm.tsx": "Contact form Card component with name, email, and message inputs, client-side validation, submission via useSubmitContact hook, loading states, and toast notifications for success/error feedback.",
  "frontend/src/components/FAQ.tsx": "FAQ section with Accordion component displaying five collapsible question-answer pairs about programming experience, course duration, Go language benefits, Discord community, and VIP membership.",
  "frontend/src/components/Footer.tsx": "Site footer with three-column grid layout showing GoCode Zone branding, quick navigation links, Discord community link, copyright notice, and Caffeine.ai attribution with dynamic UTM tracking.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation with GoCode Zone logo, desktop horizontal menu and mobile Sheet drawer, displaying seven navigation links with active state highlighting based on current route.",
  "frontend/src/components/Testimonials.tsx": "Displays a grid of three student testimonials with avatars, names, roles, and feedback content about the GoCode Zone learning platform.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all contacts and submitting new contact form data through the backend actor, with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including Go brand colors (blue and cyan) and utility classes for styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/About.tsx": "About page explaining what Go/Golang is, describing the GoCode Zone platform's mission and curriculum, and listing target audiences (beginners, students, developers) with icons.",
  "frontend/src/pages/Contact.tsx": "Contact page with a hero section and two-column layout featuring a contact form and cards for alternative contact methods (Discord, email, and messaging).",
  "frontend/src/pages/Course.tsx": "Displays the course syllabus page with 4 units covering Go fundamentals (Getting Started, Variables & Data Types, If & Switch, Loops), showing unit details, topics, and navigation to lessons.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with Go Gopher image, benefits grid (beginner-friendly lessons, quizzes, coding challenges, community), testimonials, and FAQ sections with CTAs to join Discord and view course.",
  "frontend/src/pages/Join.tsx": "Discord community invitation page highlighting community features (active support, live help, events, safe space), step-by-step joining instructions, and community rules with a CTA button linking to Discord invite.",
  "frontend/src/pages/Privacy.tsx": "Privacy policy page displaying information collection practices, usage policies, and user rights in a card-based layout with sections for collected data types, usage, and contact information.",
  "frontend/src/pages/VIP.tsx": "VIP membership sales page showcasing premium features (private mentorship, advanced lessons, real-world projects, priority support) with comparison between standard and VIP features, pricing, and upgrade CTA.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, fonts (Inter and JetBrains Mono), and accordion animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for GoCode Zone, a Go programming learning platform with Discord integration, featuring 4-unit course curriculum, VIP membership, and multiple pages (Home, About, Course, Join Discord, Privacy Policy). Tracks 8 implemented features including testimonials and FAQ sections."
}