{
  "backend/main.mo": "Main Motoko actor implementing course management (units, lessons, announcements), user profiles, membership tracking, contact form submissions, and authorization via MixinAuthorization with AccessControl for admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting two authentication flow features (REQ-26 and REQ-27) related to debugging admin redirect logic and verifying useIsAdmin hook behavior in LoginButton.tsx.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App.tsx routing setup, hooks for backend queries, navigation/footer components, page components (Home, About, Course, Join, VIP, Privacy, Contact), LoginButton with admin redirect, and styling configurations.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark themes, including background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'GoCode Zone' title, root div for React mounting, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for all pages (home, about, course, join, vip, privacy, contact, admin), shared Layout component with Navigation/Footer, ThemeProvider wrapper, and Toaster for notifications.",
  "frontend/src/components/admin/AnnouncementManager.tsx": "Admin component for creating and publishing announcements with a form (title, content) and a list view of all published announcements with formatted timestamps.",
  "frontend/src/components/admin/CourseEditor.tsx": "Admin component for editing course unit content (title, description, topics) with inline editing functionality, save/cancel actions, and mutation-based updates.",
  "frontend/src/components/admin/LessonManager.tsx": "Admin component for adding new lessons with form inputs (title, content, unit association, order) and displaying existing lessons grouped by unit.",
  "frontend/src/components/admin/MembersList.tsx": "Displays a searchable, scrollable list of all registered members with their VIP status, principal IDs, and join dates. Uses skeleton loaders during data fetching and shows member count.",
  "frontend/src/components/admin/VIPManager.tsx": "Admin component for granting and revoking VIP access to members by principal ID. Includes confirmation dialogs, displays current VIP members list, and handles VIP status mutations with toast notifications.",
  "frontend/src/components/AnnouncementsList.tsx": "Component fetching and displaying announcements from backend using useGetAllAnnouncements hook, rendering cards with megaphone icon, title, formatted timestamp, and content with loading skeletons.",
  "frontend/src/components/ContactForm.tsx": "Contact form card component with name, email, and message inputs, client-side validation, submission via useSubmitContact mutation hook, toast notifications for success/error, and loading state with spinner.",
  "frontend/src/components/FAQ.tsx": "FAQ section component rendering five common questions about GoCode Zone in an accordion UI, covering topics like beginner-friendliness, course duration, Go language benefits, Discord community, and VIP membership.",
  "frontend/src/components/Footer.tsx": "Footer component displaying brand logo, quick navigation links (About, Course, VIP, Privacy), Discord community link, copyright notice, and a \"Built with caffeine.ai\" attribution with dynamic UTM parameters.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component using Internet Identity authentication that handles login state, invalidates queries on auth changes, and automatically redirects admin users to the admin panel after successful login.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with desktop and mobile (sheet) layouts, displaying navigation links (Home, About, Course, Join Discord, VIP, Contact), conditional Admin link for authenticated admins, and integrated LoginButton.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section component displaying three hardcoded student testimonials in a responsive grid layout with avatars, names, roles, and feedback content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing access control with admin token from URL params. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider component with login/logout functionality, identity management, and configurable AuthClient options. Manages authentication state and delegation validity.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including contacts, course units, announcements, lessons, VIP members, and admin checks. Each mutation hook invalidates relevant queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including Go brand colors (blue and cyan). Defines design tokens for colors, borders, and UI components using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/About.tsx": "About page describing Go programming language and GoCode Zone platform, including target audiences (beginners, students, developers) and platform features. Uses hero section, informational cards, and icons from lucide-react.",
  "frontend/src/pages/Admin.tsx": "Admin panel page with authentication and authorization checks using Internet Identity. Provides tabbed interface for managing courses, announcements, lessons, VIP access, and members list.",
  "frontend/src/pages/Contact.tsx": "Contact page with a contact form and multiple communication channels (Discord, email, message). Displays contact options in cards with icons and links.",
  "frontend/src/pages/Course.tsx": "Course syllabus page displaying course units fetched from backend with loading skeletons. Shows unit details including topics, badges, and structured learning path from beginner to advanced.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, benefits cards, announcements list, testimonials, and FAQ. Features call-to-action buttons for joining Discord and viewing course content.",
  "frontend/src/pages/Join.tsx": "React page component for the Discord community join page, displaying community features, joining steps, and server rules with a hero section and call-to-action button linking to Discord.",
  "frontend/src/pages/Privacy.tsx": "React page component that renders the Privacy Policy page with sections covering information collection, usage, data protection, and user rights in a card-based layout.",
  "frontend/src/pages/VIP.tsx": "React page component for the VIP membership page, showcasing premium features like private mentorship, advanced lessons, and real-world projects with comparison between standard and VIP offerings.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color schemes (with Go-specific colors), container settings, border radius variables, custom fonts, and animation keyframes.",
  "project_state.json": "Project state file tracking GoCode Zone, a Go programming learning platform with courses, quizzes, Discord integration, and admin panel. Contains 17 implemented features including home, about, course, privacy pages, authentication, and admin functionality, with one known issue where users are redirected to home instead of admin panel after login."
}